/*
 * 
 * Найдена причина, по которой происходил ML: дело в стратегии увеличения длины массива на единицу. 
 * В момент каждого realloc было необходимо использовать cap + (cap + 1) памяти, чтобы скопировать
 * элементы из старого места в новое. 
 * 
 * Замена стратегии роста длины массива на cap *= 2 приводит к тому, что удвоенное использование памяти 
 * происходит почти только в самом начале. 
 * Длина массива растет так: 1, 2, 4, 8, 16, 32, 64, 128, 256, 512, 1024, 2048, 4096, 8192, 16384, 32768, 65536, 131072
 * 
 * То есть в пиковый момент программа держала для перелоцирования массива 65536 + 131072 == 196608 ячеек
 * А при стратегии cap++: 99999 + 100000 = 200000-1
 * 
 * Второе число и вывело программу за лимит по памяти.
 * 
 */


#include <stdlib.h>
#include <stdio.h>

int main(void)
{

    int  buffer = 0;

    int  *arr_ptr = malloc(sizeof(int ));
    size_t sz = 0;
    size_t cap = 1;
    
    do {
        scanf("%d", &buffer);

        if (sz == cap) {
            arr_ptr = realloc(arr_ptr, (cap*2) * sizeof(int ));
            cap *= 2;
        }

        arr_ptr[sz] = buffer;
        sz++;

    } while (buffer != 0);

    printf("%zu\n", sz-1);

    if (sz == 1) {
        free(arr_ptr);
        return 0;
    }

    for (int i = sz-2; i >= 0; i--) {
        printf("%d ", arr_ptr[i]);
    }

    free(arr_ptr);
    return 0;
}
